netsale-server/gsoapFor51Book/GetPolicyByPnrTxtServiceImpl_USCORE1_USCORE0ServiceSoapBinding.getPolicyByPnrTxt.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns1="http://getpolicybypnrtxt.b2b.service.version1_0.webservice.model.ltips.com/">
 <SOAP-ENV:Body>
   <ns1:getPolicyByPnrTxt>
    <request>
     <agencyCode></agencyCode>
     <sign></sign>
     <allowSwitchPnr>0</allowSwitchPnr>
     <needSpePricePolicy>0</needSpePricePolicy>
     <needSpeRulePolicy>0</needSpeRulePolicy>
     <onlyOnWorking>0</onlyOnWorking>
     <param1></param1>
     <param2></param2>
     <param3></param3>
     <param4></param4>
     <pataTxt></pataTxt>
     <pnrTxt></pnrTxt>
    </request>
   </ns1:getPolicyByPnrTxt>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
